export const subjectsData = {
  physics: {
    title: "পদার্থবিজ্ঞান",
    papers: {
      "1st": [
  "ভৌত জগৎ ও পরিমাপ",
  "ভেক্টর",
  "গতিবিদ্যা",
  "নিউটোনীয় বলবিদ্যা",
  "কাজ, শক্তি ও ক্ষমতা",
  "মহাকর্ষ ও অভিকর্ষ",
  "পদার্থের গাঠনিক ধর্ম",
  "পর্যায়বৃত্ত গতি",
  "তরঙ্গ",
  "আদর্শ গ্যাস ও গ্যাসের গতিতত্ত্ব",
  "শব্দ"
      ],
      "2nd": [
  "তাপগতিবিদ্যা",
  "স্থির তড়িৎ",
  "চল তড়িৎ",
  "চৌম্বক ক্ষেত্র",
  "তড়িৎচৌম্বকীয় আবেশ ও পরিবর্তী প্রবাহ",
  "জ্যামিতিক আলোকবিজ্ঞান",
  "ভৌত আলোকবিজ্ঞান",
  "আধুনিক পদার্থবিজ্ঞানের সূচনা",
  "পরমাণু মডেল ও নিউক্লিয়ার পদার্থবিজ্ঞান",
  "সেমিকন্ডাক্টর ও ইলেকট্রনিক্স",
  "জ্যোতির্বিজ্ঞান",
  "আপেক্ষিকতা"
      ],
    },
  },

  chemistry: {
    title: "রসায়ন",
    papers: {
      "1st": [
        "গঠন ও বৈশিষ্ট্য",
        "রাসায়নিক পরিবর্তন",
        "রাসায়নিক শক্তি",
        "গ্যাসের সূত্র ও তত্ত্ব",
        "তরল ও কঠিন",
        "তড়িৎ রসায়ন",
      ],
      "2nd": [
        "আবির্ভাব ও পর্যায়বিন্যাস",
        "রাসায়নিক বন্ধন",
        "অ্যামোনিয়া ও নাইট্রিক অ্যাসিড",
        "গন্ধক ও সালফিউরিক অ্যাসিড",
        "জৈব যৌগ",
        "পলিমার ও জীব রসায়ন",
      ],
    },
  },

  "higher-math": {
    title: "উচ্চতর গণিত",
    papers: {
      "1st": [
        "বাস্তব সংখ্যা",
        "বীজগাণিতিক সূত্র",
        "লগারিদম",
        "সমীকরণ",
        "সমানুপাত ধারা",
        "স্থানাঙ্ক জ্যামিতি",
        "ত্রিকোণমিতি",
      ],
      "2nd": [
        "অন্তরকরণ",
        "সমাকলন",
        "ভেক্টর",
        "ম্যাট্রিক্স",
        "সম্ভাবনা",
      ],
    },
  },

  biology: {
    title: "জীববিজ্ঞান",
    papers: {
      "1st": [
        "কোষ গঠন ও কার্যাবলি",
        "কোষ বিভাজন",
        "টিস্যু",
        "জীবন প্রক্রিয়া",
        "রক্ত সঞ্চালন",
        "শ্বাস-প্রশ্বাস",
        "উদ্ভিদের পরিবহন",
      ],
      "2nd": [
        "বংশগতি",
        "জেনেটিক্স",
        "উদ্ভিদ শারীরতত্ত্ব",
        "প্রাণী শারীরতত্ত্ব",
        "পরিবেশবিদ্যা",
        "উদ্ভিদ প্রজনন",
      ],
    },
  },

  bangla: {
    title: "বাংলা",
    papers: {
      "1st": ["সাহিত্য পাঠ", "কবিতা", "গদ্য", "নাটক", "রচনা"],
      "2nd": ["ব্যাকরণ", "প্রবন্ধ", "চিঠি ও আবেদনপত্র", "সংলাপ"],
    },
  },

  english: {
    title: "English",
    papers: {
      "1st": ["Seen Comprehension", "Unseen Comprehension", "Grammar Part A"],
      "2nd": [
        "Paragraph Writing",
        "Essay Writing",
        "Letter/Application",
        "Story Writing",
        "Dialogue Writing",
      ],
    },
  },

  ict: {
    title: "তথ্য ও যোগাযোগ প্রযুক্তি",
    papers: {
      "1st": [
        "আইসিটির বিশ্ব",
        "সংখ্যা পদ্ধতি",
        "কম্পিউটার সিস্টেম",
        "ডাটাবেজ",
        "নেটওয়ার্কিং",
        "প্রোগ্রামিং ভাষা",
      ],
    },
  },

  gk: {
    title: "সাধারণ জ্ঞান",
    papers: {
      "papers": [
        "বাংলাদেশ",
        "আন্তর্জাতিক",
        "বিজ্ঞান ও প্রযুক্তি",
        "ইতিহাস",
        "ভূগোল",
        "সমসাময়িক বিশ্ব",
      ],
    },
  },
};
