export const subjects = [
  { id: 1, name: "বাংলা" },
  { id: 2, name: "ইংরেজি" },
  { id: 3, name: "গণিত" },
  { id: 4, name: "সাধারণ জ্ঞান" },
];

export const presetExams = [
  "মডেল টেস্ট ১",
  "মডেল টেস্ট ২",
  "মডেল টেস্ট ৩",
];

export const mcqQuestions = [
  {
    id: 1,
    question: "বাংলাদেশের স্বাধীনতা দিবস কবে?",
    options: ["১৬ই ডিসেম্বর", "২৬শে মার্চ", "২১শে ফেব্রুয়ারি", "১লা জানুয়ারি"],
    correctAnswer: "২৬শে মার্চ",
  },
  {
    id: 2,
    question: "‘গীতাঞ্জলি’ কাব্যের রচয়িতা কে?",
    options: ["কাজী নজরুল ইসলাম", "রবীন্দ্রনাথ ঠাকুর", "মাইকেল মধুসূদন দত্ত", "সেলিনা হোসেন"],
    correctAnswer: "রবীন্দ্রনাথ ঠাকুর",
  },
];
